zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.h
/***************************************************************************//**
* \file cy_capsense_generator_lp.h
* \version 10.0.0
*
* \brief
* This file provides the function prototypes specific to the register
* map generation module.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#if !defined(CY_CAPSENSE_GENERATOR_LP_H)
#define CY_CAPSENSE_GENERATOR_LP_H

#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sm_base_full_wave_lp.h"

#if (defined(CY_IP_M0S8MSCV3LP))

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateBaseConfig(
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_GeneratePinFunctionConfig(
                const cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_GenerateModeConfig(
                const cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_GenerateSensorConfig(
                uint32_t snsFrameType,
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_GenerateAllSensorConfig(
                uint32_t snsFrameType,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_GenerateCdacConfig(
                const cy_stc_capsense_scan_slot_t * ptrScanSlot,
                uint32_t * ptrSensorCfg,
                const cy_stc_capsense_context_t * context);
void Cy_CapSense_CalculateMaskRegisters(
                uint32_t mask,
                uint32_t funcState,
                uint32_t * ptrCfg);
uint32_t Cy_CapSense_AdjustSnsClkDivider(
                uint8_t snsMethod,
                uint8_t snsClkSource,
                uint16_t snsClkDivider);
void Cy_CapSense_ApplyWidgetCdacParam(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
/** \} \endcond */


/*******************************************************************************
* Sensing modes
*******************************************************************************/
/** CSD sense mode configuration index */
#define CY_CAPSENSE_REG_MODE_CSD                        (0u)
/** CSX sense mode configuration index */
#define CY_CAPSENSE_REG_MODE_CSX                        (1u)
/** ISX sense mode configuration index */
#define CY_CAPSENSE_REG_MODE_ISX                        (2u)
/** CSD sense mode configuration index with CapDAC dithering enabled */
#define CY_CAPSENSE_REG_MODE_CSD_DITHERING              (3u)
/** CSX sense mode configuration index with CapDAC dithering enabled */
#define CY_CAPSENSE_REG_MODE_CSX_DITHERING              (4u)
/** ISX sense mode configuration index with CapDAC dithering enabled */
#define CY_CAPSENSE_REG_MODE_ISX_DITHERING              (5u)
/** WBX sense mode configuration index */
#define CY_CAPSENSE_REG_MODE_WBX                        (6u)
/** Sense mode undefined */
#define CY_CAPSENSE_REG_MODE_UNDEFINED                  (255u)


/*******************************************************************************
* Sensor Config Register indexes in the frame
*******************************************************************************/
#define CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL0                                  (0u)
#define CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL1                                  (1u)
#define CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL2                                  (2u)
#define CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL3                                  (3u)
#define CY_CAPSENSE_FRM_LP_SNS_LP_AOS_SNS_CTL4                                  (4u)
#define CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK2_INDEX                        (5u)
#define CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK1_INDEX                        (6u)
#define CY_CAPSENSE_FRM_LP_SNS_SW_SEL_CSW_LO_MASK0_INDEX                        (7u)
#define CY_CAPSENSE_FRM_LP_SNS_SCAN_CTL_INDEX                                   (8u)
#define CY_CAPSENSE_FRM_LP_SNS_CDAC_CTL_INDEX                                   (9u)
#define CY_CAPSENSE_FRM_LP_SNS_CTL_INDEX                                        (10u)

#define CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK2_INDEX                               (0u)
#define CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK1_INDEX                               (1u)
#define CY_CAPSENSE_SNS_SW_SEL_CSW_LO_MASK0_INDEX                               (2u)
#define CY_CAPSENSE_SNS_SCAN_CTL_INDEX                                          (3u)
#define CY_CAPSENSE_SNS_CDAC_CTL_INDEX                                          (4u)
#define CY_CAPSENSE_SNS_CTL_INDEX                                               (5u)
#define CY_CAPSENSE_SNS_HW_IIR_INDEX                                            (6u)


