zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.h
/*******************************************************************************
* Scaling Macros
*******************************************************************************/
#define CY_CAPSENSE_CDAC_REF_MAX_VALUE                                          (255u)
#define CY_CAPSENSE_CDAC_FINE_MAX_VALUE                                         (31u)
#define CY_CAPSENSE_CDAC_COMP_MAX_VALUE                                         (255u)
#define CY_CAPSENSE_CDAC_REF_MIN_VALUE                                          (1u)
#define CY_CAPSENSE_CDAC_FINE_MIN_VALUE                                         (1u)
#define CY_CAPSENSE_CDAC_COMP_MIN_VALUE                                         (0u)
#define CY_CAPSENSE_CDAC_TRIM_MIDDLE_POINT                                      (32768u)
#define CY_CAPSENSE_CDAC_TRIM_ROUND                                             (16384u)
#define CY_CAPSENSE_CDAC_TRIM_OFFSET                                            (15u)
#define CY_CAPSENSE_CDAC_TRIM_OVERFLOW_OFFSET                                   (6u)
#define CY_CAPSENSE_CDAC_FINE_LSB_X100                                          (260u)


/*******************************************************************************
* Macros for Cmod selection
*******************************************************************************/
#define CY_CAPSENSE_CMOD12_PAIR_SELECTION                                       (0uL)


/* CSW0 = GND */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW0_GND_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC0_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC0_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC0_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC0_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC0_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC0_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW1 = HIGH-Z */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW1_HIGH_Z_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC1_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC1_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC1_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC1_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC1_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC1_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW2 = CSX RX */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW2_CSX_RX_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC2_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC2_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC2_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC2_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC2_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC2_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW3 = CSX TX */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW3_CSX_TX_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC3_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC3_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC3_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC3_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC3_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC3_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW4 = CSX NTX */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW4_CSX_NEG_TX_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC4_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC4_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC4_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC4_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC4_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC4_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW5 = CSD SNS */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW5_CSD_SNS_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC5_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC5_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC5_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC5_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC5_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC5_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW6 = ISX LX */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW6_ISX_LX_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC6_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC6_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC6_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC6_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC6_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC6_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW7 = ISX RX */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW7_ISX_RX_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC7_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC7_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC7_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC7_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC7_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC7_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW8 = SHIELD Active */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW8_ACT_SHLD_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC8_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC8_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC8_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC8_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC8_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC8_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW9 = SHIELD Passive */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW9_PAS_SHLD_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC9_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC9_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC9_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC9_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC9_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC9_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW10 = VDDA/2 */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW10_VDDA2_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC10_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC10_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC10_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC10_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC10_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC10_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

