zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.h
/* CSW11 = CSP */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW11_CSP_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC11_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC11_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC11_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC11_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC11_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC11_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW12 = CSN */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW12_CSN_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC12_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC12_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC12_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC12_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC12_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC12_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW13 = CSZ */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW13_CSZ_VALUE \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC13_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC13_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC13_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC13_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC13_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC13_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW14 = Wheatstone Bridge Node A */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW14_WBX_NODE_A \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC14_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC14_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC14_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC14_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC14_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC14_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))

/* CSW15 = Wheatstone Bridge Node B */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW15_WBX_NODE_B \
((CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC15_FLD_SW_AMUXA << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXA_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC15_FLD_SW_AMUXB << MSCLP_SW_SEL_CSW_FUNC_SW_AMUXB_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC15_FLD_SW_PU    << MSCLP_SW_SEL_CSW_FUNC_SW_PU_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC15_FLD_SW_PD    << MSCLP_SW_SEL_CSW_FUNC_SW_PD_Pos)    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC15_FLD_REF_MODE << MSCLP_SW_SEL_CSW_FUNC_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CSW_FUNC15_FLD_DDRV_EN  << MSCLP_SW_SEL_CSW_FUNC_DDRV_EN_Pos))


/* Indexes of this values must correspond to the CY_CAPSENSE_CTRLMUX_PIN_STATE_... definitions in the common.h */
#define CY_CAPSENSE_PIN_STATES_ARR \
{CY_CAPSENSE_SM_REG_SW_SEL_CSW0_GND_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW1_HIGH_Z_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW2_CSX_RX_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW3_CSX_TX_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW4_CSX_NEG_TX_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW5_CSD_SNS_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW6_ISX_LX_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW7_ISX_RX_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW8_ACT_SHLD_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW9_PAS_SHLD_VALUE,\
 CY_CAPSENSE_SM_REG_SW_SEL_CSW10_VDDA2_VALUE, \
 CY_CAPSENSE_SM_REG_SW_SEL_CSW11_CSP_VALUE, \
 CY_CAPSENSE_SM_REG_SW_SEL_CSW12_CSN_VALUE, \
 CY_CAPSENSE_SM_REG_SW_SEL_CSW13_CSZ_VALUE, \
 CY_CAPSENSE_SM_REG_SW_SEL_CSW14_WBX_NODE_A, \
 CY_CAPSENSE_SM_REG_SW_SEL_CSW15_WBX_NODE_B}


/************************* CSD RM register values *****************************/

#define CY_CAPSENSE_CSD_RM_SENSE_DUTY_CTL \
((CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH0_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH0_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH1_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH1_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH2_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH2_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH3_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH3_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_GAP_FS2_PH0_EN << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_FS2_PH0_EN_Pos)  | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_GAP_FS2_PH1_EN << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_FS2_PH1_EN_Pos)  | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PH_GAP_2CYCLE_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PH_GAP_2CYCLE_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH0X_EN    << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH0X_EN_Pos)     | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH1X_EN    << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH1X_EN_Pos)     | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHX_GAP_2CYCLE_EN    << MSCLP_MODE_SENSE_DUTY_CTL_PHX_GAP_2CYCLE_EN_Pos)     | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_SHIFT_EN       << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_SHIFT_EN_Pos)        | \
 (CY_CAPSENSE_SM_REG_MODE0_SENSE_DUTY_CTL_FLD_PHASE_MODE_SEL       << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_MODE_SEL_Pos))

#define CY_CAPSENSE_CSD_RM_SW_SEL_CDAC_FL \
((CY_CAPSENSE_SM_REG_MODE0_SW_SEL_CDAC_FL_FLD_SW_FLTCA             << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLTCA_Pos)              | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_CDAC_FL_FLD_SW_FLCB              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLCB_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_CDAC_FL_FLD_SW_FLTV              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLTV_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_CDAC_FL_FLD_SW_FLTG              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLTG_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_CDAC_FL_FLD_SW_FLBV              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLBV_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_CDAC_FL_FLD_SW_FLBG              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLBG_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_CDAC_FL_FLD_ACTIVATION_MODE      << MSCLP_MODE_SW_SEL_CDAC_FL_ACTIVATION_MODE_Pos))

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SHIELD_ACTIVE_EN)
#define CY_CAPSENSE_CSD_RM_SW_SEL_TOP \
((CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_CACB                     << MSCLP_MODE_SW_SEL_TOP_CACB_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_CACC                     << MSCLP_MODE_SW_SEL_TOP_CACC_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_CBCD                     << MSCLP_MODE_SW_SEL_TOP_CBCD_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_AYA_CTL                  << MSCLP_MODE_SW_SEL_TOP_AYA_CTL_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_AYA_EN                   << MSCLP_MODE_SW_SEL_TOP_AYA_EN_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_AYB_CTL                  << MSCLP_MODE_SW_SEL_TOP_AYB_CTL_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_AYB_EN                   << MSCLP_MODE_SW_SEL_TOP_AYB_EN_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_BYB                      << MSCLP_MODE_SW_SEL_TOP_BYB_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_BGRF                     << MSCLP_MODE_SW_SEL_TOP_BGRF_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_RMF                      << MSCLP_MODE_SW_SEL_TOP_RMF_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_TOP_FLD_MBF                      << MSCLP_MODE_SW_SEL_TOP_MBF_Pos))

#define CY_CAPSENSE_CSD_RM_SW_SEL_SH \
((CY_CAPSENSE_SM_REG_MODE6_SW_SEL_SH_FLD_SOMB                      << MSCLP_MODE_SW_SEL_SH_SOMB_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_SH_FLD_CBSO                      << MSCLP_MODE_SW_SEL_SH_CBSO_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_SH_FLD_SPCS1                     << MSCLP_MODE_SW_SEL_SH_SPCS1_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_SH_FLD_SPCS3                     << MSCLP_MODE_SW_SEL_SH_SPCS3_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_SH_FLD_FSP                       << MSCLP_MODE_SW_SEL_SH_FSP_Pos)                        | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_SH_FLD_BUF_SEL                   << MSCLP_MODE_SW_SEL_SH_BUF_SEL_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE6_SW_SEL_SH_FLD_BUF_EN                    << MSCLP_MODE_SW_SEL_SH_BUF_EN_Pos))
#elif (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SHIELD_PASSIVE_EN)
#define CY_CAPSENSE_CSD_RM_SW_SEL_TOP \
((CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_CACB                     << MSCLP_MODE_SW_SEL_TOP_CACB_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_CACC                     << MSCLP_MODE_SW_SEL_TOP_CACC_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_CBCD                     << MSCLP_MODE_SW_SEL_TOP_CBCD_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_AYA_CTL                  << MSCLP_MODE_SW_SEL_TOP_AYA_CTL_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_AYA_EN                   << MSCLP_MODE_SW_SEL_TOP_AYA_EN_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_AYB_CTL                  << MSCLP_MODE_SW_SEL_TOP_AYB_CTL_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_AYB_EN                   << MSCLP_MODE_SW_SEL_TOP_AYB_EN_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_BYB                      << MSCLP_MODE_SW_SEL_TOP_BYB_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_BGRF                     << MSCLP_MODE_SW_SEL_TOP_BGRF_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_RMF                      << MSCLP_MODE_SW_SEL_TOP_RMF_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_TOP_FLD_MBF                      << MSCLP_MODE_SW_SEL_TOP_MBF_Pos))

#define CY_CAPSENSE_CSD_RM_SW_SEL_SH \
((CY_CAPSENSE_SM_REG_MODE8_SW_SEL_SH_FLD_SOMB                      << MSCLP_MODE_SW_SEL_SH_SOMB_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_SH_FLD_CBSO                      << MSCLP_MODE_SW_SEL_SH_CBSO_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_SH_FLD_SPCS1                     << MSCLP_MODE_SW_SEL_SH_SPCS1_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_SH_FLD_SPCS3                     << MSCLP_MODE_SW_SEL_SH_SPCS3_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_SH_FLD_FSP                       << MSCLP_MODE_SW_SEL_SH_FSP_Pos)                        | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_SH_FLD_BUF_SEL                   << MSCLP_MODE_SW_SEL_SH_BUF_SEL_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE8_SW_SEL_SH_FLD_BUF_EN                    << MSCLP_MODE_SW_SEL_SH_BUF_EN_Pos))
#else
#define CY_CAPSENSE_CSD_RM_SW_SEL_TOP \
((CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_CACB                     << MSCLP_MODE_SW_SEL_TOP_CACB_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_CACC                     << MSCLP_MODE_SW_SEL_TOP_CACC_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_CBCD                     << MSCLP_MODE_SW_SEL_TOP_CBCD_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_AYA_CTL                  << MSCLP_MODE_SW_SEL_TOP_AYA_CTL_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_AYA_EN                   << MSCLP_MODE_SW_SEL_TOP_AYA_EN_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_AYB_CTL                  << MSCLP_MODE_SW_SEL_TOP_AYB_CTL_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_AYB_EN                   << MSCLP_MODE_SW_SEL_TOP_AYB_EN_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_BYB                      << MSCLP_MODE_SW_SEL_TOP_BYB_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_BGRF                     << MSCLP_MODE_SW_SEL_TOP_BGRF_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_RMF                      << MSCLP_MODE_SW_SEL_TOP_RMF_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_TOP_FLD_MBF                      << MSCLP_MODE_SW_SEL_TOP_MBF_Pos))

#define CY_CAPSENSE_CSD_RM_SW_SEL_SH \
((CY_CAPSENSE_SM_REG_MODE0_SW_SEL_SH_FLD_SOMB                      << MSCLP_MODE_SW_SEL_SH_SOMB_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_SH_FLD_CBSO                      << MSCLP_MODE_SW_SEL_SH_CBSO_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_SH_FLD_SPCS1                     << MSCLP_MODE_SW_SEL_SH_SPCS1_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_SH_FLD_SPCS3                     << MSCLP_MODE_SW_SEL_SH_SPCS3_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_SH_FLD_FSP                       << MSCLP_MODE_SW_SEL_SH_FSP_Pos)                        | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_SH_FLD_BUF_SEL                   << MSCLP_MODE_SW_SEL_SH_BUF_SEL_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE0_SW_SEL_SH_FLD_BUF_EN                    << MSCLP_MODE_SW_SEL_SH_BUF_EN_Pos))
#endif /* CY_CAPSENSE_ENABLE == CY_CAPSENSE_SHIELD_ACTIVE_EN */

