zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.h
#define CY_CAPSENSE_CSD_RM_DITHER_SW_SEL_CMOD1 \
((CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD1_FLD_SW_AMUXA               << MSCLP_MODE_SW_SEL_CMOD1_SW_AMUXA_Pos)                | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD1_FLD_SW_C1CA                << MSCLP_MODE_SW_SEL_CMOD1_SW_C1CA_Pos)                 | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD1_FLD_SW_C1CC                << MSCLP_MODE_SW_SEL_CMOD1_SW_C1CC_Pos)                 | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD1_FLD_SW_AMUXB               << MSCLP_MODE_SW_SEL_CMOD1_SW_AMUXB_Pos)                | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD1_FLD_SW_PU                  << MSCLP_MODE_SW_SEL_CMOD1_SW_PU_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD1_FLD_SW_PD                  << MSCLP_MODE_SW_SEL_CMOD1_SW_PD_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD1_FLD_REF_MODE               << MSCLP_MODE_SW_SEL_CMOD1_REF_MODE_Pos)                | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD1_FLD_DDRV_EN                << MSCLP_MODE_SW_SEL_CMOD1_DDRV_EN_Pos))

#define CY_CAPSENSE_CSD_RM_DITHER_SW_SEL_CMOD2 \
((CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD2_FLD_SW_AMUXA               << MSCLP_MODE_SW_SEL_CMOD2_SW_AMUXA_Pos)                | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD2_FLD_SW_AMUXB               << MSCLP_MODE_SW_SEL_CMOD2_SW_AMUXB_Pos)                | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD2_FLD_SW_C2CB                << MSCLP_MODE_SW_SEL_CMOD2_SW_C2CB_Pos)                 | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD2_FLD_SW_C2CD                << MSCLP_MODE_SW_SEL_CMOD2_SW_C2CD_Pos)                 | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD2_FLD_SW_PU                  << MSCLP_MODE_SW_SEL_CMOD2_SW_PU_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD2_FLD_SW_PD                  << MSCLP_MODE_SW_SEL_CMOD2_SW_PD_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD2_FLD_REF_MODE               << MSCLP_MODE_SW_SEL_CMOD2_REF_MODE_Pos)                | \
 (CY_CAPSENSE_SM_REG_MODE3_SW_SEL_CMOD2_FLD_DDRV_EN                << MSCLP_MODE_SW_SEL_CMOD2_DDRV_EN_Pos))

/****************** CSX RM with CapDAC dithering register values *********************/

#define CY_CAPSENSE_CSX_RM_DITHER_SENSE_DUTY_CTL \
((CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH0_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH0_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH1_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH1_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH2_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH2_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH3_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH3_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_GAP_FS2_PH0_EN << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_FS2_PH0_EN_Pos)  | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_GAP_FS2_PH1_EN << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_FS2_PH1_EN_Pos)  | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PH_GAP_2CYCLE_EN     << MSCLP_MODE_SENSE_DUTY_CTL_PH_GAP_2CYCLE_EN_Pos)      | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH0X_EN    << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH0X_EN_Pos)     | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_GAP_PH1X_EN    << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_GAP_PH1X_EN_Pos)     | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHX_GAP_2CYCLE_EN    << MSCLP_MODE_SENSE_DUTY_CTL_PHX_GAP_2CYCLE_EN_Pos)     | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_SHIFT_EN       << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_SHIFT_EN_Pos)        | \
 (CY_CAPSENSE_SM_REG_MODE4_SENSE_DUTY_CTL_FLD_PHASE_MODE_SEL       << MSCLP_MODE_SENSE_DUTY_CTL_PHASE_MODE_SEL_Pos))

#define CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_CDAC_FL \
((CY_CAPSENSE_SM_REG_MODE4_SW_SEL_CDAC_FL_FLD_SW_FLTCA             << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLTCA_Pos)              | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_CDAC_FL_FLD_SW_FLCB              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLCB_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_CDAC_FL_FLD_SW_FLTV              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLTV_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_CDAC_FL_FLD_SW_FLTG              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLTG_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_CDAC_FL_FLD_SW_FLBV              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLBV_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_CDAC_FL_FLD_SW_FLBG              << MSCLP_MODE_SW_SEL_CDAC_FL_SW_FLBG_Pos)               | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_CDAC_FL_FLD_ACTIVATION_MODE      << MSCLP_MODE_SW_SEL_CDAC_FL_ACTIVATION_MODE_Pos))

#define CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_TOP \
((CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_CACB                     << MSCLP_MODE_SW_SEL_TOP_CACB_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_CACC                     << MSCLP_MODE_SW_SEL_TOP_CACC_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_CBCD                     << MSCLP_MODE_SW_SEL_TOP_CBCD_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_AYA_CTL                  << MSCLP_MODE_SW_SEL_TOP_AYA_CTL_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_AYA_EN                   << MSCLP_MODE_SW_SEL_TOP_AYA_EN_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_AYB_CTL                  << MSCLP_MODE_SW_SEL_TOP_AYB_CTL_Pos)                   | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_AYB_EN                   << MSCLP_MODE_SW_SEL_TOP_AYB_EN_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_BYB                      << MSCLP_MODE_SW_SEL_TOP_BYB_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_BGRF                     << MSCLP_MODE_SW_SEL_TOP_BGRF_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_RMF                      << MSCLP_MODE_SW_SEL_TOP_RMF_Pos)                       | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_TOP_FLD_MBF                      << MSCLP_MODE_SW_SEL_TOP_MBF_Pos))

#define CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_COMP \
((CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CPCS1                   << MSCLP_MODE_SW_SEL_COMP_CPCS1_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CPCS3                   << MSCLP_MODE_SW_SEL_COMP_CPCS3_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CPMA                    << MSCLP_MODE_SW_SEL_COMP_CPMA_Pos)                     | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CPCA                    << MSCLP_MODE_SW_SEL_COMP_CPCA_Pos)                     | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CPCB                    << MSCLP_MODE_SW_SEL_COMP_CPCB_Pos)                     | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CMCB                    << MSCLP_MODE_SW_SEL_COMP_CMCB_Pos)                     | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CPF                     << MSCLP_MODE_SW_SEL_COMP_CPF_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CMCS2                   << MSCLP_MODE_SW_SEL_COMP_CMCS2_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CMCS4                   << MSCLP_MODE_SW_SEL_COMP_CMCS4_Pos)                    | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CMV                     << MSCLP_MODE_SW_SEL_COMP_CMV_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CMG                     << MSCLP_MODE_SW_SEL_COMP_CMG_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_CMF                     << MSCLP_MODE_SW_SEL_COMP_CMF_Pos)                      | \
 (CY_CAPSENSE_SM_REG_MODE4_SW_SEL_COMP_FLD_HALF_WAVE_EN            << MSCLP_MODE_SW_SEL_COMP_HALF_WAVE_EN_Pos))

