zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.h
#define CY_CAPSENSE_CSD_RM_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_CSD_RM_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_CSD_RM_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_CSD_RM_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_CSD_RM_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_CSD_RM_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_CSD_RM_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_CSD_RM_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_CSX_RM_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_CSX_RM_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_CSX_RM_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_CSX_RM_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_CSX_RM_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_CSX_RM_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_CSX_RM_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_CSX_RM_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_ISX_RM_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_ISX_RM_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_ISX_RM_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_ISX_RM_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_ISX_RM_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_ISX_RM_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_ISX_RM_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_ISX_RM_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_MPSC_RM_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_MPSC_RM_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_MPSC_RM_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_MPSC_RM_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_MPSC_RM_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_MPSC_RM_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_MPSC_RM_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_MPSC_RM_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_CSD_RM_DITHER_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_CSD_RM_DITHER_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_CSD_RM_DITHER_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_CSD_RM_DITHER_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_CSD_RM_DITHER_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_CSD_RM_DITHER_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_CSD_RM_DITHER_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_CSD_RM_DITHER_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_CSX_RM_DITHER_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_CSX_RM_DITHER_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_CSX_RM_DITHER_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_ISX_RM_DITHER_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_ISX_RM_DITHER_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_ISX_RM_DITHER_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_ISX_RM_DITHER_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_ISX_RM_DITHER_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_ISX_RM_DITHER_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_ISX_RM_DITHER_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_ISX_RM_DITHER_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_MPSC_DITHER_RM_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_MPSC_RM_DITHER_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_MPSC_RM_DITHER_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_WBX_RM_MODE \
    { \
        .senseDutyCtl = CY_CAPSENSE_WBX_SENSE_DUTY_CTL,\
        .swSelCdacFl  = CY_CAPSENSE_WBX_SW_SEL_CDAC_FL,\
        .swSelTop     = CY_CAPSENSE_WBX_SW_SEL_TOP,    \
        .swSelComp    = CY_CAPSENSE_WBX_SW_SEL_COMP,   \
        .swSelSh      = CY_CAPSENSE_WBX_SW_SEL_SH,     \
        .swSelCmod1   = CY_CAPSENSE_WBX_SW_SEL_CMOD1,  \
        .swSelCmod2   = CY_CAPSENSE_WBX_SW_SEL_CMOD2,  \
    }

#define CY_CAPSENSE_SM_MODES_ARR \
    {CY_CAPSENSE_CSD_RM_MODE, CY_CAPSENSE_CSX_RM_MODE, CY_CAPSENSE_ISX_RM_MODE, \
     CY_CAPSENSE_CSD_RM_DITHER_MODE, CY_CAPSENSE_CSX_RM_DITHER_MODE, CY_CAPSENSE_ISX_RM_DITHER_MODE, \
     CY_CAPSENSE_WBX_RM_MODE}


/** Initialization of sensing method template variable */

#define CY_CAPSENSE_WBX_SW_SEL_CDAC_CO_DIRECT \
((CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTCA                    << MSCLP_SW_SEL_CDAC_CO_SW_COTCA_Pos)                   | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COCB                     << MSCLP_SW_SEL_CDAC_CO_SW_COCB_Pos)                    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTV                     << MSCLP_SW_SEL_CDAC_CO_SW_COTV_Pos)                    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTG                     << MSCLP_SW_SEL_CDAC_CO_SW_COTG_Pos)                    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COBG                     << MSCLP_SW_SEL_CDAC_CO_SW_COBG_Pos)                    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COBV                     << MSCLP_SW_SEL_CDAC_CO_SW_COBV_Pos))

#define CY_CAPSENSE_WBX_SW_SEL_CDAC_CO_INVERTED \
((CY_CAPSENSE_SM_MPSC_REG_SW_SEL_CDAC_CO_FLD_SW_COTCA               << MSCLP_SW_SEL_CDAC_CO_SW_COTCA_Pos)                   | \
 (CY_CAPSENSE_SM_MPSC_REG_SW_SEL_CDAC_CO_FLD_SW_COCB                << MSCLP_SW_SEL_CDAC_CO_SW_COCB_Pos)                    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTV                     << MSCLP_SW_SEL_CDAC_CO_SW_COTV_Pos)                    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTG                     << MSCLP_SW_SEL_CDAC_CO_SW_COTG_Pos)                    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COBG                     << MSCLP_SW_SEL_CDAC_CO_SW_COBG_Pos)                    | \
 (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COBV                     << MSCLP_SW_SEL_CDAC_CO_SW_COBV_Pos))


