zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_lp.h
#define CY_CAPSENSE_SENSING_METHOD_BASE_TEMPLATE \
    { \
        .ctl = \
                    ((CY_CAPSENSE_SM_REG_CTL_FLD_SENSE_EN << MSCLP_CTL_SENSE_EN_Pos)                                                        |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_MSCCMP_EN << MSCLP_CTL_MSCCMP_EN_Pos)                                                       |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_CLK_SYNC_EN << MSCLP_CTL_CLK_SYNC_EN_Pos)                                                   |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_EXT_FRAME_START_MODE << MSCLP_CTL_EXT_FRAME_START_MODE_Pos)                                 |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_CFG_OFFSET << MSCLP_CTL_CFG_OFFSET_Pos)                                                     |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_OPERATING_MODE << MSCLP_CTL_OPERATING_MODE_Pos)                                             |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_BUF_MODE << MSCLP_CTL_BUF_MODE_Pos)                                                         |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_CLK_MSC_RATIO << MSCLP_CTL_CLK_MSC_RATIO_Pos)                                               |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_DEBUG_EN << MSCLP_CTL_DEBUG_EN_Pos)                                                         |\
                    (CY_CAPSENSE_SM_REG_CTL_FLD_ENABLED << MSCLP_CTL_ENABLED_Pos)),                                                          \
        .scanCtl1 = \
                    ((CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_NUM_AUTO_RESAMPLE << MSCLP_SCAN_CTL1_NUM_AUTO_RESAMPLE_Pos)                          |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_RESCAN_DEBUG_MODE << MSCLP_SCAN_CTL1_RESCAN_DEBUG_MODE_Pos)                           |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_NUM_SAMPLES << MSCLP_SCAN_CTL1_NUM_SAMPLES_Pos)                                       |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_RAW_COUNT_MODE << MSCLP_SCAN_CTL1_RAW_COUNT_MODE_Pos)                                 |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_DEBUG_CONV_PH_SEL << MSCLP_SCAN_CTL1_DEBUG_CONV_PH_SEL_Pos)                           |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_FRAME_RES_START_ADDR << MSCLP_SCAN_CTL1_FRAME_RES_START_ADDR_Pos)                     |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_RC_STORE_EN << MSCLP_SCAN_CTL1_RC_STORE_EN_Pos)                                       |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL1_FLD_RC_STORE_MODE << MSCLP_SCAN_CTL1_RC_STORE_MODE_Pos)),                                  \
        .scanCtl2 = \
                    ((CY_CAPSENSE_SM_REG_SCAN_CTL2_FLD_NUM_EPI_KREF_DELAY_PRS << MSCLP_SCAN_CTL2_NUM_EPI_KREF_DELAY_PRS_Pos)                |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL2_FLD_NUM_EPI_KREF_DELAY << MSCLP_SCAN_CTL2_NUM_EPI_KREF_DELAY_Pos)                         |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL2_FLD_CHOP_POL << MSCLP_SCAN_CTL2_CHOP_POL_Pos)                                             |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL2_FLD_FRAME_CFG_START_ADDR << MSCLP_SCAN_CTL2_FRAME_CFG_START_ADDR_Pos)                     |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL2_FLD_EXT_REF_CLK_EN << MSCLP_SCAN_CTL2_EXT_REF_CLK_EN_Pos)                                 |\
                    (CY_CAPSENSE_SM_REG_SCAN_CTL2_FLD_INFINITE_SCAN_MODE << MSCLP_SCAN_CTL2_INFINITE_SCAN_MODE_Pos)),                        \
        .initCtl1 = \
                    ((CY_CAPSENSE_SM_REG_INIT_CTL1_FLD_NUM_INIT_CMOD_12_RAIL_CYCLES << MSCLP_INIT_CTL1_NUM_INIT_CMOD_12_RAIL_CYCLES_Pos)    |\
                    (CY_CAPSENSE_SM_REG_INIT_CTL1_FLD_NUM_INIT_CMOD_12_SHORT_CYCLES << MSCLP_INIT_CTL1_NUM_INIT_CMOD_12_SHORT_CYCLES_Pos)   |\
                    (CY_CAPSENSE_SM_REG_INIT_CTL1_FLD_PER_SAMPLE << MSCLP_INIT_CTL1_PER_SAMPLE_Pos)),                                        \
        .initCtl2 = \
                    (0u),                                                                                                                    \
        .initCtl3 = \
                    ((CY_CAPSENSE_SM_REG_INIT_CTL3_FLD_NUM_PRO_OFFSET_CYCLES << MSCLP_INIT_CTL3_NUM_PRO_OFFSET_CYCLES_Pos)                  |\
                    (CY_CAPSENSE_SM_REG_INIT_CTL3_FLD_NUM_PRO_OFFSET_TRIPS << MSCLP_INIT_CTL3_NUM_PRO_OFFSET_TRIPS_Pos)                     |\
                    (CY_CAPSENSE_SM_REG_INIT_CTL3_FLD_CMOD_SEL << MSCLP_INIT_CTL3_CMOD_SEL_Pos)                                             |\
                    (CY_CAPSENSE_SM_REG_INIT_CTL3_FLD_INIT_MODE << MSCLP_INIT_CTL3_INIT_MODE_Pos)),                                          \
        .initCtl4 = \
                    ((CY_CAPSENSE_SM_REG_INIT_CTL4_FLD_NUM_PRO_DUMMY_SUB_CONVS << MSCLP_INIT_CTL4_NUM_PRO_DUMMY_SUB_CONVS_Pos)              |\
                    (CY_CAPSENSE_SM_REG_INIT_CTL4_FLD_NUM_PRO_WAIT_KREF_DELAY_PRS << MSCLP_INIT_CTL4_NUM_PRO_WAIT_KREF_DELAY_PRS_Pos)       |\
                    (CY_CAPSENSE_SM_REG_INIT_CTL4_FLD_NUM_PRO_WAIT_KREF_DELAY << MSCLP_INIT_CTL4_NUM_PRO_WAIT_KREF_DELAY_Pos)               |\
                    (CY_CAPSENSE_SM_REG_INIT_CTL4_FLD_PRO_BYPASS << MSCLP_INIT_CTL4_PRO_BYPASS_Pos)),                                        \
        .senseDutyCtl = \
                    ((CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH << MSCLP_SENSE_DUTY_CTL_PHASE_WIDTH_Pos)                            |\
                    (CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_SHIFT_CYCLES << MSCLP_SENSE_DUTY_CTL_PHASE_SHIFT_CYCLES_Pos)               |\
                    (CY_CAPSENSE_SM_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH_SEL << MSCLP_SENSE_DUTY_CTL_PHASE_WIDTH_SEL_Pos)),                    \
        .sensePeriodCtl = \
                    ((CY_CAPSENSE_SM_REG_SENSE_PERIOD_CTL_FLD_LFSR_POLY << MSCLP_SENSE_PERIOD_CTL_LFSR_POLY_Pos)                            |\
                    (CY_CAPSENSE_SM_REG_SENSE_PERIOD_CTL_FLD_LFSR_SCALE << MSCLP_SENSE_PERIOD_CTL_LFSR_SCALE_Pos)),                          \
        .filterCtl = \
                    ((CY_CAPSENSE_SM_REG_FILTER_CTL_FLD_BIT_FORMAT << MSCLP_FILTER_CTL_BIT_FORMAT_Pos)                                      |\
                    (CY_CAPSENSE_SM_REG_FILTER_CTL_FLD_FILTER_MODE << MSCLP_FILTER_CTL_FILTER_MODE_Pos)),                                    \
        .ccompCdacCtl = \
                    ((CY_CAPSENSE_SM_REG_CCOMP_CDAC_CTL_FLD_SEL_CO_PRO_OFFSET << MSCLP_CCOMP_CDAC_CTL_SEL_CO_PRO_OFFSET_Pos)                |\
                    (CY_CAPSENSE_SM_REG_CCOMP_CDAC_CTL_FLD_COMP_BLANKING_MODE << MSCLP_CCOMP_CDAC_CTL_COMP_BLANKING_MODE_Pos)               |\
                    (CY_CAPSENSE_SM_REG_CCOMP_CDAC_CTL_FLD_EPILOGUE_EN << MSCLP_CCOMP_CDAC_CTL_EPILOGUE_EN_Pos)),                            \
        .ditherCdacCtl = \
                    ((CY_CAPSENSE_SM_REG_DITHER_CDAC_CTL_FLD_SEL_FL << MSCLP_DITHER_CDAC_CTL_SEL_FL_Pos)                                    |\
                    (CY_CAPSENSE_SM_REG_DITHER_CDAC_CTL_FLD_LFSR_POLY_FL << MSCLP_DITHER_CDAC_CTL_LFSR_POLY_FL_Pos)),                        \
        .mscCmpCtl = \
                    ((CY_CAPSENSE_SM_REG_MSCCMP_CTL_FLD_PWR << MSCLP_MSCCMP_CTL_PWR_Pos)                                                    |\
                    (CY_CAPSENSE_SM_REG_MSCCMP_CTL_FLD_FILT << MSCLP_MSCCMP_CTL_FILT_Pos)),                                                  \
        .obsCtl = \
                    (0u),                                                                                                                    \
        .aosCtl = \
                    ((CY_CAPSENSE_SM_REG_AOS_CTL_FLD_WAKEUP_TIMER << MSCLP_AOS_CTL_WAKEUP_TIMER_Pos)                                        |\
                     (CY_CAPSENSE_SM_REG_AOS_CTL_FLD_FR_TIMEOUT_INTERVAL << MSCLP_AOS_CTL_FR_TIMEOUT_INTERVAL_Pos)                          |\
                     (CY_CAPSENSE_SM_REG_AOS_CTL_FLD_STOP_ON_SD << MSCLP_AOS_CTL_STOP_ON_SD_Pos)                                            |\
                     (CY_CAPSENSE_SM_REG_AOS_CTL_FLD_MRSS_PWR_CYCLE_EN << MSCLP_AOS_CTL_MRSS_PWR_CYCLE_EN_Pos)),                             \
        .ceCtl = \
                    ((CY_CAPSENSE_SM_REG_CE_CTL_FLD_RCF_EN << MSCLP_CE_CTL_RCF_EN_Pos)                                                      |\
                     (CY_CAPSENSE_SM_REG_CE_CTL_FLD_BLSD_EN << MSCLP_CE_CTL_BLSD_EN_Pos)                                                    |\
                     (CY_CAPSENSE_SM_REG_CE_CTL_FLD_CE_TEST_MODE << MSCLP_CE_CTL_CE_TEST_MODE_Pos)                                          |\
                     (CY_CAPSENSE_SM_REG_CE_CTL_FLD_ENABLED << MSCLP_CE_CTL_ENABLED_Pos)),                                                   \
        .pumpCtl = \
                    (CY_CAPSENSE_SM_REG_PUMP_CTL_FLD_PUMP_MODE << MSCLP_PUMP_CTL_PUMP_MODE_Pos),                                             \
        .intr = \
                    ((CY_CAPSENSE_SM_REG_INTR_FLD_SUB_SAMPLE << MSCLP_INTR_SUB_SAMPLE_Pos)                                                  |\
                     (CY_CAPSENSE_SM_REG_INTR_FLD_SAMPLE << MSCLP_INTR_SAMPLE_Pos)                                                          |\
                     (CY_CAPSENSE_SM_REG_INTR_FLD_SCAN << MSCLP_INTR_SCAN_Pos)                                                              |\
                     (CY_CAPSENSE_SM_REG_INTR_FLD_INIT << MSCLP_INTR_INIT_Pos)                                                              |\
                     (CY_CAPSENSE_SM_REG_INTR_FLD_FRAME << MSCLP_INTR_FRAME_Pos)                                                            |\
                     (CY_CAPSENSE_SM_REG_INTR_FLD_CONFIG_REQ << MSCLP_INTR_CONFIG_REQ_Pos)                                                  |\
                     (CY_CAPSENSE_SM_REG_INTR_FLD_FIFO_UNDERFLOW << MSCLP_INTR_FIFO_UNDERFLOW_Pos)                                          |\
                     (CY_CAPSENSE_SM_REG_INTR_FLD_FIFO_OVERFLOW << MSCLP_INTR_FIFO_OVERFLOW_Pos)),                                           \
        .intrSet = \
                    ((CY_CAPSENSE_SM_REG_INTR_SET_FLD_SUB_SAMPLE << MSCLP_INTR_SET_SUB_SAMPLE_Pos)                                          |\
                     (CY_CAPSENSE_SM_REG_INTR_SET_FLD_SAMPLE << MSCLP_INTR_SET_SAMPLE_Pos)                                                  |\
                     (CY_CAPSENSE_SM_REG_INTR_SET_FLD_SCAN << MSCLP_INTR_SET_SCAN_Pos)                                                      |\
                     (CY_CAPSENSE_SM_REG_INTR_SET_FLD_INIT << MSCLP_INTR_SET_INIT_Pos)                                                      |\
                     (CY_CAPSENSE_SM_REG_INTR_SET_FLD_FRAME << MSCLP_INTR_SET_FRAME_Pos)                                                    |\
                     (CY_CAPSENSE_SM_REG_INTR_SET_FLD_CONFIG_REQ << MSCLP_INTR_SET_CONFIG_REQ_Pos)                                          |\
                     (CY_CAPSENSE_SM_REG_INTR_SET_FLD_FIFO_UNDERFLOW << MSCLP_INTR_SET_FIFO_UNDERFLOW_Pos)                                  |\
                     (CY_CAPSENSE_SM_REG_INTR_SET_FLD_FIFO_OVERFLOW << MSCLP_INTR_SET_FIFO_OVERFLOW_Pos)),                                   \
        .intrMask = \
                    (0u),                                                                                                                    \
        .intrLp = \
                    ((CY_CAPSENSE_SM_REG_INTR_LP_FLD_SIG_DET << MSCLP_INTR_LP_SIG_DET_Pos)                                                  |\
                     (CY_CAPSENSE_SM_REG_INTR_LP_FLD_FR_TIMEOUT << MSCLP_INTR_LP_FR_TIMEOUT_Pos)                                            |\
                     (CY_CAPSENSE_SM_REG_INTR_LP_FLD_FRAME << MSCLP_INTR_LP_FRAME_Pos)                                                      |\
                     (CY_CAPSENSE_SM_REG_INTR_LP_FLD_CE_DONE << MSCLP_INTR_LP_CE_DONE_Pos)                                                  |\
                     (CY_CAPSENSE_SM_REG_INTR_LP_FLD_IMO_UP << MSCLP_INTR_LP_IMO_UP_Pos)),                                                   \
        .intrLpSet = \
                    ((CY_CAPSENSE_SM_REG_INTR_LP_SET_FLD_SIG_DET << MSCLP_INTR_LP_SET_SIG_DET_Pos)                                          |\
                     (CY_CAPSENSE_SM_REG_INTR_LP_SET_FLD_FR_TIMEOUT << MSCLP_INTR_LP_SET_FR_TIMEOUT_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_INTR_LP_SET_FLD_FRAME << MSCLP_INTR_LP_SET_FRAME_Pos)                                              |\
                     (CY_CAPSENSE_SM_REG_INTR_LP_SET_FLD_CE_DONE << MSCLP_INTR_LP_SET_CE_DONE_Pos)                                          |\
                     (CY_CAPSENSE_SM_REG_INTR_LP_SET_FLD_IMO_UP << MSCLP_INTR_LP_SET_IMO_UP_Pos)),                                           \
        .intrLpMask = \
                    (0u),                                                                                                                    \
        .swSelCdacRe = \
                    ((CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_RETCC << MSCLP_SW_SEL_CDAC_RE_SW_RETCC_Pos)                                  |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_RECD << MSCLP_SW_SEL_CDAC_RE_SW_RECD_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_RETV << MSCLP_SW_SEL_CDAC_RE_SW_RETV_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_RETG << MSCLP_SW_SEL_CDAC_RE_SW_RETG_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_REBV << MSCLP_SW_SEL_CDAC_RE_SW_REBV_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_RE_FLD_SW_REBG << MSCLP_SW_SEL_CDAC_RE_SW_REBG_Pos)),                                   \
        .swSelCdacCo = \
                    ((CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTCA << MSCLP_SW_SEL_CDAC_CO_SW_COTCA_Pos)                                  |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COCB << MSCLP_SW_SEL_CDAC_CO_SW_COCB_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTV << MSCLP_SW_SEL_CDAC_CO_SW_COTV_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COTG << MSCLP_SW_SEL_CDAC_CO_SW_COTG_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COBV << MSCLP_SW_SEL_CDAC_CO_SW_COBV_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CO_FLD_SW_COBG << MSCLP_SW_SEL_CDAC_CO_SW_COBG_Pos)),                                   \
        .swSelCdacCf = \
                    ((CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CF_FLD_SW_CFTCA << MSCLP_SW_SEL_CDAC_CF_SW_CFTCA_Pos)                                  |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CF_FLD_SW_CFTCB << MSCLP_SW_SEL_CDAC_CF_SW_CFTCB_Pos)                                  |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CF_FLD_SW_CFTV << MSCLP_SW_SEL_CDAC_CF_SW_CFTV_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CF_FLD_SW_CFTG << MSCLP_SW_SEL_CDAC_CF_SW_CFTG_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CF_FLD_SW_CFBV << MSCLP_SW_SEL_CDAC_CF_SW_CFBV_Pos)                                    |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_CDAC_CF_FLD_SW_CFBG << MSCLP_SW_SEL_CDAC_CF_SW_CFBG_Pos)),                                   \
        .swSelBgr = \
                    ((CY_CAPSENSE_SM_REG_SW_SEL_BGR_FLD_SW_BGRCM << MSCLP_SW_SEL_BGR_SW_BGRCM_Pos)                                          |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_BGR_FLD_SW_IGMA << MSCLP_SW_SEL_BGR_SW_IGMA_Pos)                                            |\
                     (CY_CAPSENSE_SM_REG_SW_SEL_BGR_FLD_SW_BGRMA << MSCLP_SW_SEL_BGR_SW_BGRMA_Pos)),                                         \
        .swSelCswFunc = \
        { \
            [0u] = 0u,                                                                                                                       \
            [1u] = 0u,                                                                                                                       \
            [2u] = 0u,                                                                                                                       \
            [3u] = 0u,                                                                                                                       \
            [4u] = 0u,                                                                                                                       \
            [5u] = 0u,                                                                                                                       \
            [6u] = 0u,                                                                                                                       \
            [7u] = 0u,                                                                                                                       \
        }, \
        .mode = \
        { \
            [0u] = \
            { \
                .senseDutyCtl = 0u,                                                                                                          \
                .swSelCdacFl = 0u,                                                                                                           \
                .swSelTop = 0u,                                                                                                              \
                .swSelComp = 0u,                                                                                                             \
                .swSelSh = 0u,                                                                                                               \
                .swSelCmod1 = 0u,                                                                                                            \
                .swSelCmod2 = 0u,                                                                                                            \
            }, \
            [1u] = \
            { \
                .senseDutyCtl = 0u,                                                                                                          \
                .swSelCdacFl = 0u,                                                                                                           \
                .swSelTop = 0u,                                                                                                              \
                .swSelComp = 0u,                                                                                                             \
                .swSelSh = 0u,                                                                                                               \
                .swSelCmod1 = 0u,                                                                                                            \
                .swSelCmod2 = 0u,                                                                                                            \
            }, \
            [2u] = \
            { \
                .senseDutyCtl = 0u,                                                                                                          \
                .swSelCdacFl = 0u,                                                                                                           \
                .swSelTop = 0u,                                                                                                              \
                .swSelComp = 0u,                                                                                                             \
                .swSelSh = 0u,                                                                                                               \
                .swSelCmod1 = 0u,                                                                                                            \
                .swSelCmod2 = 0u,                                                                                                            \
            }, \
            [3u] = \
            { \
                .senseDutyCtl = 0u,                                                                                                          \
                .swSelCdacFl = 0u,                                                                                                           \
                .swSelTop = 0u,                                                                                                              \
                .swSelComp = 0u,                                                                                                             \
                .swSelSh = 0u,                                                                                                               \
                .swSelCmod1 = 0u,                                                                                                            \
                .swSelCmod2 = 0u,                                                                                                            \
            }, \
        }, \
    }




/** \cond SECTION_CAPSENSE_INTERNAL */
    /** The Sensor Frame types, to be used with \ref Cy_CapSense_GenerateSensorConfig and \ref Cy_CapSense_GenerateAllSensorConfig */
    #define CY_CAPSENSE_SNS_FRAME_ACTIVE     (0u) /**<  - Sensor frame for Active slot    */
    #define CY_CAPSENSE_SNS_FRAME_LOW_POWER  (1u) /**<  - Sensor frame for Low Power slot */
/** \endcond */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_M0S8MSCV3LP */

#endif /* CY_CAPSENSE_GENERATOR_LP_H */


/* [] END OF FILE */
